--Q1--
CREATE TABLE `departments`(
  `department_id`INT unisigned NOT NULL PRIMARY KEY auto_increment,
  `name`VARCHAR(20) NOT NULL,
  `created_at`TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  `updated_at`TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) 

--Q2--
ALTER TABLE people ADD department_id INT unisigned AFTER email;

--Q3--
INSERT INTO departments (name)VALUES
  ('開発'),
  ('経理'),
  ('人事'),
  ('情報システム');
Query OK, 4 rows affected (0.005 sec)
Records: 4  Duplicates: 0  Warnings: 0

SELECT * FROM departments;
+---------------+--------------+---------------------+---------------------+
| department_id | name         | created_at          | updated_at          |
+---------------+--------------+---------------------+---------------------+
|             1 | 営業         | 2025-04-25 14:48:04 | 2025-04-25 16:02:17 |
|             2 | 開発         | 2025-04-25 16:12:37 | 2025-04-25 16:12:37 |
|             3 | 経理         | 2025-04-25 16:12:37 | 2025-04-25 16:12:37 |
|             4 | 人事         | 2025-04-25 16:12:37 | 2025-04-25 16:12:37 |
|             5 | 情報システム | 2025-04-25 16:12:37 | 2025-04-25 16:12:37 |
+---------------+--------------+---------------------+---------------------+
5 rows in set (0.001 sec)

SELECT * FROM people;
+-----------+--------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                          | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし         | suzuki@beyond-works.co.jp      |          NULL |   20 |      1 | 2025-04-24 10:49:03 | 2025-04-24 10:49:03 |
|         2 | 田中ゆうこ         | tanaka@beyond-works.co.jp      |          NULL |   25 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         3 | 福田だいすけ       | fukuda@beyond-works.co.jp      |          NULL |   42 |      1 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         4 | 豊島はなこ         | toyoshima@beyond-works.co.jp   |          NULL |   34 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|        32 | ジャングルジム佐藤 | jungle@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        33 | ジングルベル佐藤   | jinglebell@beyond-works.co.jp  |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        34 | まだ見ぬ世界       | notyetsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        35 | 西日本佐藤         | westjpsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        36 | げんこつ山佐藤     | genkotsu@beyond-works.co.jp    |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        37 | イエローカード佐藤 | yellow@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
+-----------+--------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+

INSERT INTO reports (person_id,content)VALUES
  (38,'春はあけぼの左中間方向に飛んだ打球は'),
  (39,'ビーアンビシャス我が友よ冒険者よ'),
  (40,'ぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽ'),
  (41,'退場ですあなた退場です本当に退場です'),
  (42,'あなたすごいわねすごいわねすごおおい'),
  (43,'僕が生まれたこの島の空を僕はどれくらい知ってるんだろう'),
  (44,'ランチョンがあるのなら朝ごはんはモーチョンマットですね'),
  (45,'ゴールデンウィークはビーステップをやります'),
  (46,'ごんぎつねごんぎつねごんぎつねごんぎつね'),
  (47,'リユースリデュースリサイクルやったー');
Query OK, 10 rows affected (0.005 sec)
Records: 10  Duplicates: 0  Warnings: 0

--Q4--
 SELECT * FROM people;
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                   | email                          | department_id | age  | gender | created_at          | updated_at          |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし             | suzuki@beyond-works.co.jp      |          NULL |   20 |      1 | 2025-04-24 10:49:03 | 2025-04-24 10:49:03 |
|         2 | 田中ゆうこ             | tanaka@beyond-works.co.jp      |          NULL |   25 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         3 | 福田だいすけ           | fukuda@beyond-works.co.jp      |          NULL |   42 |      1 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         4 | 豊島はなこ             | toyoshima@beyond-works.co.jp   |          NULL |   34 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|        32 | ジャングルジム佐藤     | jungle@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        33 | ジングルベル佐藤       | jinglebell@beyond-works.co.jp  |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        34 | まだ見ぬ世界           | notyetsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        35 | 西日本佐藤             | westjpsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        36 | げんこつ山佐藤         | genkotsu@beyond-works.co.jp    |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        37 | イエローカード佐藤     | yellow@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        38 | 紫式部佐藤             | NULL                           |             4 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        39 | アンビシャス佐藤       | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        40 | オフサイド佐藤         | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        41 | レッドカード佐藤       | NULL                           |             3 |   23 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        42 | デヴィ佐藤             | NULL                           |             2 |   77 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        43 | 久能山佐藤             | NULL                           |             2 |   12 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        44 | ランチョンマット佐藤   | NULL                           |             2 |   32 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        45 | ゴールデンウィーク佐藤 | NULL                           |             2 |   53 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        46 | 読み聞かせ佐藤         | NULL                           |             1 |   48 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        47 | リサイクル佐藤         | NULL                           |             5 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
20 rows in set (0.000 sec)

SELECT * FROM people;
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                   | email                          | department_id | age  | gender | created_at          | updated_at          |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし             | suzuki@beyond-works.co.jp      |             2 |   20 |      1 | 2025-04-24 10:49:03 | 2025-04-25 16:58:34 |
|         2 | 田中ゆうこ             | tanaka@beyond-works.co.jp      |          NULL |   25 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         3 | 福田だいすけ           | fukuda@beyond-works.co.jp      |          NULL |   42 |      1 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|         4 | 豊島はなこ             | toyoshima@beyond-works.co.jp   |          NULL |   34 |      2 | 2025-04-24 10:50:48 | 2025-04-24 10:50:48 |
|        32 | ジャングルジム佐藤     | jungle@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        33 | ジングルベル佐藤       | jinglebell@beyond-works.co.jp  |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        34 | まだ見ぬ世界           | notyetsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        35 | 西日本佐藤             | westjpsatoh@beyond-works.co.jp |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        36 | げんこつ山佐藤         | genkotsu@beyond-works.co.jp    |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        37 | イエローカード佐藤     | yellow@beyond-works.co.jp      |          NULL |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-24 14:36:42 |
|        38 | 紫式部佐藤             | NULL                           |             4 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        39 | アンビシャス佐藤       | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        40 | オフサイド佐藤         | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        41 | レッドカード佐藤       | NULL                           |             3 |   23 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        42 | デヴィ佐藤             | NULL                           |             2 |   77 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        43 | 久能山佐藤             | NULL                           |             2 |   12 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        44 | ランチョンマット佐藤   | NULL                           |             2 |   32 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        45 | ゴールデンウィーク佐藤 | NULL                           |             2 |   53 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        46 | 読み聞かせ佐藤         | NULL                           |             1 |   48 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        47 | リサイクル佐藤         | NULL                           |             5 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
20 rows in set (0.000 sec)

UPDATE people SET department_id = 2 WHERE person_id =2;
Query OK, 1 row affected (0.004 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =3;
Query OK, 1 row affected (0.002 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =4;
Query OK, 1 row affected (0.004 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =32;
Query OK, 1 row affected (0.005 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =33;
Query OK, 1 row affected (0.002 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =34;
Query OK, 1 row affected (0.058 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =35;
Query OK, 1 row affected (0.004 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 2 WHERE person_id =36;
Query OK, 1 row affected (0.004 sec)
Rows matched: 1  Changed: 1  Warnings: 0

UPDATE people SET department_id = 1 WHERE person_id =37;
Query OK, 1 row affected (0.004 sec)
Rows matched: 1  Changed: 1  Warnings: 0

SELECT * FROM people;
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name                   | email                          | department_id | age  | gender | created_at          | updated_at          |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
|         1 | 鈴木たかし             | suzuki@beyond-works.co.jp      |             2 |   20 |      1 | 2025-04-24 10:49:03 | 2025-04-25 16:58:34 |
|         2 | 田中ゆうこ             | tanaka@beyond-works.co.jp      |             2 |   25 |      2 | 2025-04-24 10:50:48 | 2025-04-25 16:59:28 |
|         3 | 福田だいすけ           | fukuda@beyond-works.co.jp      |             2 |   42 |      1 | 2025-04-24 10:50:48 | 2025-04-25 16:59:35 |
|         4 | 豊島はなこ             | toyoshima@beyond-works.co.jp   |             2 |   34 |      2 | 2025-04-24 10:50:48 | 2025-04-25 16:59:42 |
|        32 | ジャングルジム佐藤     | jungle@beyond-works.co.jp      |             2 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 16:59:48 |
|        33 | ジングルベル佐藤       | jinglebell@beyond-works.co.jp  |             2 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 16:59:54 |
|        34 | まだ見ぬ世界           | notyetsatoh@beyond-works.co.jp |             2 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 17:00:01 |
|        35 | 西日本佐藤             | westjpsatoh@beyond-works.co.jp |             2 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 17:00:07 |
|        36 | げんこつ山佐藤         | genkotsu@beyond-works.co.jp    |             2 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 17:00:11 |
|        37 | イエローカード佐藤     | yellow@beyond-works.co.jp      |             1 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 17:00:21 |
|        38 | 紫式部佐藤             | NULL                           |             4 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        39 | アンビシャス佐藤       | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        40 | オフサイド佐藤         | NULL                           |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        41 | レッドカード佐藤       | NULL                           |             3 |   23 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        42 | デヴィ佐藤             | NULL                           |             2 |   77 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        43 | 久能山佐藤             | NULL                           |             2 |   12 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        44 | ランチョンマット佐藤   | NULL                           |             2 |   32 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        45 | ゴールデンウィーク佐藤 | NULL                           |             2 |   53 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        46 | 読み聞かせ佐藤         | NULL                           |             1 |   48 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        47 | リサイクル佐藤         | NULL                           |             5 |   65 |      1 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
+-----------+------------------------+--------------------------------+---------------+------+--------+---------------------+---------------------+
20 rows in set (0.000 sec)

--Q5--
 SELECT name,age FROM people WHERE gender = 1 ORDER BY age DESC;
+----------------------+------+
| name                 | age  |
+----------------------+------+
| リサイクル佐藤       |   65 |
| 紫式部佐藤           |   65 |
| イエローカード佐藤   |   61 |
| げんこつ山佐藤       |   61 |
| 西日本佐藤           |   61 |
| まだ見ぬ世界         |   61 |
| ジングルベル佐藤     |   61 |
| ジャングルジム佐藤   |   61 |
| 福田だいすけ         |   42 |
| ランチョンマット佐藤 |   32 |
| 鈴木たかし           |   20 |
| 久能山佐藤           |   12 |
+----------------------+------+
12 rows in set (0.001 sec)

--Q6--
SELECT
  `name`, `email`, `age`
  ---既存のテーブルから「名前」「メールアドレス」「年齢」の3つの項目だけを取得する---
FROM
  `people`
  ---「people」のテーブルを指定してレコードやカラムなどのデータを取り出す---
WHERE
  `department_id` = 1
  ---「department_id」が1である人だけのレコード(行)絞ってデータを取得する---
ORDER BY
  `created_at`;
  ---「created_at」というカラムの値を使って、作成日時の順に並べて表示させる---


--Q7--
SELECT * FROM people WHERE (gender = 2 AND age BETWEEN 20 AND 29) OR (gender = 1 AND age BETWEEN 40 AND 49);
+-----------+------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name             | email                     | department_id | age  | gender | created_at          | updated_at          |
+-----------+------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
|         2 | 田中ゆうこ       | tanaka@beyond-works.co.jp |             2 |   25 |      2 | 2025-04-24 10:50:48 | 2025-04-25 16:59:28 |
|         3 | 福田だいすけ     | fukuda@beyond-works.co.jp |             2 |   42 |      1 | 2025-04-24 10:50:48 | 2025-04-25 16:59:35 |
|        41 | レッドカード佐藤 | NULL                      |             3 |   23 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
+-----------+------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
3 rows in set (0.004 sec)

--Q8--
SELECT * FROM people WHERE department_id = 1 ORDER BY age ASC;
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
| person_id | name               | email                     | department_id | age  | gender | created_at          | updated_at          |
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
|        46 | 読み聞かせ佐藤     | NULL                      |             1 |   48 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        39 | アンビシャス佐藤   | NULL                      |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        40 | オフサイド佐藤     | NULL                      |             1 |   55 |      2 | 2025-04-25 16:38:33 | 2025-04-25 16:38:33 |
|        37 | イエローカード佐藤 | yellow@beyond-works.co.jp |             1 |   61 |      1 | 2025-04-24 14:36:42 | 2025-04-25 17:00:21 |
+-----------+--------------------+---------------------------+---------------+------+--------+---------------------+---------------------+
4 rows in set (0.001 sec)

--Q9--
SELECT AVG(age) AS average_age FROM people WHERE gender = 2;
+-------------+
| average_age |
+-------------+
|     46.2500 |
+-------------+
1 row in set (0.005 sec)

--Q10--
SELECT people.name,reports.content,departments.name FROM people INNER JOIN reports ON people.person_id = reports.person_id INNER JOIN departments ON departments.department_id = people.department_id;
+------------------------+----------------------------------------------------------------------+--------------+
| name                   | content                                                              | name         |
+------------------------+----------------------------------------------------------------------+--------------+
| イエローカード佐藤     | 見えない自由がほしくて見えない銃を撃ちまくる                         | 営業         |
| アンビシャス佐藤       | ビーアンビシャス我が友よ冒険者よ                                     | 営業         |
| オフサイド佐藤         | ぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽぽ | 営業         |
| 読み聞かせ佐藤         | ごんぎつねごんぎつねごんぎつねごんぎつね                             | 営業         |
| 鈴木たかし             | ドブネズミみたいに美しくなりたい                                     | 開発         |
| 田中ゆうこ             | リンダリンダリンダリンダリンダリンダ                                 | 開発         |
| 福田だいすけ           | 写真には写せない美しさがあるから                                     | 開発         |
| 豊島はなこ             | リンゴリンゴリンゴリンゴリンゴリンゴ                                 | 開発         |
| ジャングルジム佐藤     | 本気で日報を書きなさいよコラ                                         | 開発         |
| ジングルベル佐藤       | 初めての日報はこれにします                                           | 開発         |
| 西日本佐藤             | 西日本から日報を残しておきます                                       | 開発         |
| げんこつ山佐藤         | 栄光に向かって走るあの列車に乗っていこう                             | 開発         |
| デヴィ佐藤             | あなたすごいわねすごいわねすごおおい                                 | 開発         |
| 久能山佐藤             | 僕が生まれたこの島の空を僕はどれくらい知ってるんだろう               | 開発         |
| ランチョンマット佐藤   | ランチョンがあるのなら朝ごはんはモーチョンマットですね               | 開発         |
| ゴールデンウィーク佐藤 | ゴールデンウィークはビーステップをやります                           | 開発         |
| レッドカード佐藤       | 退場ですあなた退場です本当に退場です                                 | 経理         |
| 紫式部佐藤             | 春はあけぼの左中間方向に飛んだ打球は                                 | 人事         |
| リサイクル佐藤         | リユースリデュースリサイクルやったー                                 | 情報システム |
+------------------------+----------------------------------------------------------------------+--------------+
19 rows in set (0.001 sec)

--Q11--
 SELECT p.name, r.content FROM people p LEFT OUTER JOIN reports r USING (person_id) WHERE r.content IS NULL;
+--------------+---------+
| name         | content |
+--------------+---------+
| まだ見ぬ世界 | NULL    |
+--------------+---------+
1 row in set (0.000 sec)
